# ResolutionValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..ResolutionValue Property
RenderingSettings Class See Also
---
The rendering resolution in dots per inch (DPI).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int ResolutionValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ResolutionValue As Integer
	Get
```

Visual C++
---
```text
public:
property int ResolutionValue {
	int get ();
}
```

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace